/*

Реализуйте и экспортируйте функцию по умолчанию, которая принимает на вход строку,
состоящую только из открывающих и закрывающих круглых скобок, и проверяет является 
ли эта строка корректной. Пустая строка (отсутствие скобок) считается корректной.

Строка считается корректной (сбалансированной), если содержащаяся в ней скобочная 
структура соответствует требованиям:

    Скобки — это парные структуры. У каждой открывающей скобки должна 
    быть соответствующая ей закрывающая скобка.

    Закрывающая скобка не должна идти впереди открывающей.

import areBracketsBalanced from 'roundBracketsValidator';

areBracketsBalanced('(())');  // true
areBracketsBalanced('((())'); // false

*/

const areBracketsBalanced = (str) => {
  let result = 0;
  for (let i = 0; i < str.length; i += 1) {
    result += str[i] === '(' ? 1 : -1;
    if (result < 0) return false;
  }
  return result === 0;
};

export default areBracketsBalanced;