// Создайте функцию isPerfect, которая принимает число и возвращает true, если оно совершенное, и false — в ином случае.
// Совершенное число — это положительное целое число, равное сумме его положительных делителей (не считая само число). Например, 6 — идеальное число, потому что 6 = 1 + 2 + 3.

const isPerfect = (num) => {
  if (num === 0) return false;
  let summ = 0;
  for (let i = 1; i <= num / 2; i += 1) {
    if (num % i === 0) summ += i;
  }
  return summ === num;
};

export default isPerfect;
